{"backend": "tensorflow", "class_name": "Model", "config": {"name": "model_2", "output_layers": [["time_distributed_2", 0, 0]], "input_layers": [["input_2", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_2", "class_name": "InputLayer", "config": {"name": "input_2", "dtype": "float32", "batch_input_shape": [null, 75], "sparse": false}}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "embedding_2", "class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "batch_input_shape": [null, 75], "output_dim": 50, "mask_zero": false, "input_dim": 1302, "input_length": 75, "embeddings_constraint": null, "name": "embedding_2", "embeddings_regularizer": null, "trainable": true, "activity_regularizer": null, "dtype": "float32"}}, {"inbound_nodes": [[["embedding_2", 0, 0, {}]]], "name": "dropout_2", "class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.1, "trainable": true, "seed": null, "name": "dropout_2"}}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "bidirectional_2", "class_name": "Bidirectional", "config": {"name": "bidirectional_2", "merge_mode": "concat", "trainable": true, "layer": {"class_name": "LSTM", "config": {"return_state": false, "go_backwards": false, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "return_sequences": true, "units": 100, "kernel_constraint": null, "name": "lstm_2", "implementation": 1, "kernel_regularizer": null, "stateful": false, "recurrent_dropout": 0.1, "recurrent_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dropout": 0.0, "activation": "tanh", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "unroll": false}}}}, {"inbound_nodes": [[["bidirectional_2", 0, 0, {}]]], "name": "time_distributed_2", "class_name": "TimeDistributed", "config": {"name": "time_distributed_2", "trainable": true, "layer": {"class_name": "Dense", "config": {"kernel_constraint": null, "activation": "softmax", "bias_regularizer": null, "units": 18, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "name": "dense_2", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null}}}}]}, "keras_version": "2.1.4"}